spec/cassettes/Paymongo_TransactionGateway/_sale/with_insufficient_funds_token/returns_an_ErrorResult.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.paymongo.com/v1/payments
    body:
      encoding: UTF-8
      string: '{"data":{"attributes":{"amount":20000,"currency":"PHP","description":"Payment
        for Invoice #0002","statement_descriptor":"MAKISU.CO","source":{"id":"tok_iMMCBQiKHcYmJrE3B5B1FKbS","type":"token"}}}}'
    headers:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Authorization:
      - Basic c2tfdGVzdF9jc2JzeVlwSHpYRDJLbnVZTWpWblc0ZkI6
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Tue, 13 Aug 2019 00:13:59 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
      X-Request-Id:
      - ec15fc9a-e3e3-414c-8e67-346a569159ed
      X-Runtime:
      - '0.037895'
      Content-Length:
      - '152'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"errors":[{"code":"insufficient_funds","detail":"Your card has been
        declined due to insufficient funds.","meta":{"type":"card_error"},"status":"402"}]}'
    http_version: 
  recorded_at: Tue, 13 Aug 2019 00:13:59 GMT
recorded_with: VCR 5.0.0
